Never mind, all good. Read the documentation again where it now clearly states:

```
Note

Only base project (e.g. eu-de) KMS keys can be used for the encryption
```
Doing so did indeed encrypt the bucket.

---

Any update on that one?

Facing same problem here and @lego963 your suggestion is exactly what we're doing:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # module.infrastructure.module.obs.module.xxx.opentelekomcloud_kms_key_v1.xxx will be created
  + resource "opentelekomcloud_kms_key_v1" "xxx" {
      + creation_date           = (known after apply)
      + default_key_flag        = (known after apply)
      + domain_id               = (known after apply)
      + expiration_time         = (known after apply)
      + id                      = (known after apply)
      + is_enabled              = true
      + key_alias               = "xxx"
      + key_description         = "Key to encrypt bucket"
      + origin                  = (known after apply)
      + pending_days            = "7"
      + realm                   = (known after apply)
      + scheduled_deletion_date = (known after apply)
    }
  # module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx will be created
  + resource "opentelekomcloud_obs_bucket" "xxx" {
      + acl                = "private"
      + bucket             = "xxx"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + region             = (known after apply)
      + storage_class      = "STANDARD"
      + versioning         = false
      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "log/"
        }
      + server_side_encryption {
          + algorithm  = "aws:kms"
          + kms_key_id = (known after apply)
        }
    }
  # module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx will be created
  + resource "opentelekomcloud_obs_bucket" "xxx" {
      + acl                = "log-delivery-write"
      + bucket             = "xxx"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + region             = (known after apply)
      + storage_class      = "COLD"
      + versioning         = false
    }
Plan: 3 to add, 0 to change, 0 to destroy.
module.infrastructure.module.obs.module.xxx.opentelekomcloud_kms_key_v1.xxx: Creating...
module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx: Creating...
module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx: Creation complete after 0s [id=xxx]
module.infrastructure.module.obs.module.xxx.opentelekomcloud_kms_key_v1.xxx: Still creating... [10s elapsed]
module.infrastructure.module.obs.module.xxx.opentelekomcloud_kms_key_v1.xxx: Creation complete after 10s [id=xxxxxxxxxxxxxxxxxxxxxxx]
module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx: Creating...
╷
│ Error: error setting bucket encryption: obs: service returned error: Status=403 Forbidden, Code=AccessDenied, Message=Access Denied, RequestId=xxxxxxxxxxxxxxxxxxxx
│ 
│   with module.infrastructure.module.obs.module.xxx.opentelekomcloud_obs_bucket.xxx,
│   on ../../infrastructure/obs/xxx/main.tf line 7, in resource "opentelekomcloud_obs_bucket" "xxx":
│    7: resource "opentelekomcloud_obs_bucket" "xxx" {
│ 
╵
Releasing state lock. This may take a few moments...
Cleaning up file based variables 00:00
ERROR: Job failed: command terminated with exit code 1
```

So what's the solution now?